<?php

$x = 1;
$y = 2;

echo "Сложение: " . ($x + $y) . "<br>";
echo "Конкатенация: " . ($x . $y) . "<br>";

unset($x);
if (!isset($x)) {
    echo "Переменная x не существует!<br>";
} else {
    echo "Сложение с x: " . ($x + $y) . "<br>";
    echo "Конкатенация с x: " . ($x . $y) . "<br>";
}

unset($y);
if (!isset($y)) {
    echo "Переменная y не существует!<br>";
} else {
    echo "Сложение с y: " . ($x + $y) . "<br>";
    echo "Конкатенация с y: " . ($x . $y) . "<br>";
}
?>
